Données manquantes

In [ ]:
import numpy as np
import pandas as pd

In [16]:
string_data = pd.Series(["aarggfx", "artichaut", np.nan, "avocado"])
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [17]:
# Par défaut, .dropna() supprime des lignes ("axis = 0")
df_with_na = pd.DataFrame(
    [[1, np.nan], [2, 3], [np.nan, 7]], 
    index= ["a", "b", "c"], 
    columns = ["A", "B"])
df_with_na

     A    B
a  1.0  NaN
b  2.0  3.0
c  NaN  7.0

In [18]:
df_with_na.dropna()

     A    B
b  2.0  3.0

In [19]:
# Il peut aussi supprimer des colonnes
df_with_na.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [a, b, c]

In [20]:
# .fillna()
value_to_replace_na_with = 0
df_with_na.fillna(value_to_replace_na_with)

     A    B
a  1.0  0.0
b  2.0  3.0
c  0.0  7.0

In [21]:
# .fillna() avec dict
value_to_replace_na_with = {"A":1, "B":3}
df_with_na.fillna(value_to_replace_na_with)

     A    B
a  1.0  3.0
b  2.0  3.0
c  1.0  7.0

Exercices

In [ ]:
# Importer les données du Titanic
# Remplacer les valeurs manquantes de la colonne prix par le prix moyen, et les lieux d'embarquement manquants par "C"

In [26]:
# Bonus
# Supprimer les lignes où l'âge est manquant

In [ ]:
# Bonus : filtrage avancé
# Filtrer le df suivant pour ne garder que les lignes où le prénom commence par un "A"
data = {"prenom" : ["Anna", "Ben", "Camille"], "poste": ["DE", "DE", "DS"]}
df = pd.DataFrame(data)